---
kind: other
id: Properties.T:Autodesk.Revit.DB.WallSweepInfo
source: html/6678775e-5c0b-375b-957c-c4bad537a88e.htm
---
# WallSweepInfo Properties

Indicates if you want the sweep to cut geometry out of the host wall.